tap "homebrew/cask"
tap "buo/cask-upgrade"

brew "mas"

tap "homebrew/cask-fonts"

# Example

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
brew "github-keygen"
brew "gnupg"
brew "pinentry-mac"
brew "stow"
brew "mas"
brew "gh"
cask "atom"
cask "carbon-copy-cloner"cask "atom"
cask "typora"

# TODO: include from brew.sh
# TODO: include from applications list

# # 'brew tap'
# tap "homebrew/cask"
# # 'brew tap' with custom Git URL
# tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git"
# # set arguments for all 'brew install --cask' commands
# cask_args appdir: "~/Applications", require_sha: true

# # 'brew install'
# brew "imagemagick"
# # 'brew install --with-rmtp', 'brew services restart' on version changes
# brew "denji/nginx/nginx-full", args: ["with-rmtp"], restart_service: :changed
# # 'brew install', always 'brew services restart', 'brew link', 'brew unlink mysql' (if it is installed)
# brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysql"]

# # 'brew install --cask'
# cask "google-chrome"
# # 'brew install --cask --appdir=~/my-apps/Applications'
# cask "firefox", args: { appdir: "~/my-apps/Applications" }
# # always upgrade auto-updated or unversioned cask to latest version even if already installed
# cask "opera", greedy: true
# # 'brew install --cask' only if '/usr/libexec/java_home --failfast' fails
# cask "java" unless system "/usr/libexec/java_home --failfast"

# # 'mas install'
# mas "1Password", id: 443987910


tap "adoptopenjdk/openjdk"
tap "bazelbuild/tap"
tap "bramstein/webfonttools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "ack"
brew "azure-cli"
brew "bash"
brew "bazel"
brew "chromaprint"
brew "coreutils", link: false
brew "nghttp2"
brew "openldap"
brew "dockutil"
brew "findutils"
brew "git"
brew "python@3.9"
brew "gmp"
brew "gnu-sed", args: ["with-default-names"]
brew "grep"
brew "lua"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli", link: false
brew "lastpass-cli"
brew "ldns"
brew "libevent"
brew "libpq"
brew "lynx"
brew "mackup"
brew "mas"
brew "maven"
brew "mkcert"
brew "moreutils"
brew "mysql"
brew "openssh"
brew "p7zip"
brew "php"
brew "pigz"
brew "pv"
brew "python@2"
brew "rename"
brew "rlwrap"
brew "screen"
brew "ssh-copy-id", link: true
brew "terraform"
brew "tree"
brew "vbindiff"
brew "wget"
brew "wifi-password"
brew "woff2"
brew "z"
brew "zopfli"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
cask "adoptopenjdk8"
cask "aerial"
cask "alfred"
cask "android-file-transfer"
cask "anka-flow"
cask "balenaetcher"
cask "docker"
cask "eqmac"
cask "franz"
cask "fresh"
cask "gimp"
cask "google-backup-and-sync"
cask "google-chrome"
cask "hammerspoon"
cask "handbrake"
cask "harmony"
cask "iterm2"
cask "java"
cask "little-snitch"
cask "microsoft-office"
cask "microsoft-teams"
cask "ngrok"
cask "postman"
cask "private-internet-access"
cask "provisionql"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookapk"
cask "skype"
cask "skype-for-business"
cask "sourcetree"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "subtitles"
cask "suspicious-package"
cask "teamviewer-host"
cask "tiptoi-manager"
cask "transmission"
cask "vanilla"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "wifi-explorer"
cask "wireshark"
