tap 'buo/cask-upgrade'
tap 'git-friendly/homebrew-git-friendly'
tap 'homebrew/autoupdate'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'antibody'
brew 'bitwarden-cli'
brew 'bat'
brew 'bash'
brew 'btop'
brew 'coreutils'
brew 'duf'
brew 'direnv'
brew 'exa'
brew 'fd'
brew 'fx'
brew 'git'
brew 'git-extras'
brew 'git-friendly'
brew 'git-recent'
brew 'glances'
brew 'glow'
brew 'httpie'
brew 'mackup'
brew 'mkcert'
brew 'mono'
brew 'ncdu'
brew 'pnpm'
brew 'prettyping'
brew 'starship'
brew 'thefuck'
brew 'topgrade'
brew 'tldr'
brew 'trash'
brew 'wget'
brew 'wifi-password'
brew 'zsh'

cask 'adobe-creative-cloud'
cask 'aerial'
cask 'alfred'
cask 'android-file-transfer'
cask 'anka-virtualization'
cask 'authy'
cask 'appcleaner'
cask 'balenaetcher'
cask 'bitwarden'
cask 'cakebrew'
cask 'caption'
cask 'clean-me'
cask 'corelocationcli'
cask 'dozer'
cask 'eqmac'
cask 'fig'
cask 'gmvault'
cask 'google-chrome'
cask 'hammerspoon'
cask 'handbrake'
cask 'insomnia'
cask 'insync'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keka'
cask 'kekaexternalhelper'
cask 'monolingual'
cask 'obsidian'
cask 'private-internet-access'
cask 'radarr'
cask 'replacicon'
cask 'skype'
cask 'sloth'
cask 'sonarr'
cask 'spotify'
cask 'teamviewer-host'
cask 'transmission'
cask 'tiptoi-manager'
cask 'visual-studio-code'

cask 'apparency'
cask 'qladdict'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlmobi'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'

cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-firago'
cask 'font-lato'

mas 'Bitwarden', id: 1352778147
mas 'Key Codes', id: 414568915
mas 'Keynote', id: 409183694
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Word', id: 462054704
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Space Gremlin', id: 414515628
mas 'Speediness', id: 1596706466
mas 'Speedtest by Ookla', id: 1153157709
mas 'UTC Time', id: 1538245904
mas 'WhatsApp Desktop', id: 1147396723
