# Taps
tap 'buo/cask-upgrade'
tap 'homebrew/autoupdate'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'bitwarden-cli'
brew 'ccat'
brew 'coreutils'
brew 'duf'
brew 'fx'
brew 'git'
brew 'glances'
brew 'glow'
brew 'httpie'
# lua - hammmerspoon?
brew 'jq'
brew 'mackup'
brew 'mkcert'
brew 'pure'
brew 'trash'
brew 'wget'
brew 'wifi-password'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask 'adobe-creative-cloud'
cask 'aerial'
cask 'alfred'
cask 'android-file-transfer'
cask 'anka-virtualization'
cask 'authy'
cask 'appcleaner'
cask 'balenaetcher'
cask 'bitwarden'
cask 'cakebrew'
cask 'dozer'
# cask 'eqmac' # TODO: requires attended install
cask 'google-chrome'
cask 'google-drive'
cask 'hammerspoon'
cask 'handbrake'
cask 'insomnia'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keka'
cask 'little-snitch'
cask 'monolingual'
# cask 'ngrok' # TODO: does not seem to work right now
cask 'obsidian'
cask 'private-internet-access'
cask 'radarr'
cask 'skype'
# snap camera
cask 'sonarr'
cask 'spotify'
cask 'teamviewer-host'
cask 'transmission'
cask 'tiptoi-manager'
cask 'vanilla'
cask 'visual-studio-code'

# TODO: sort
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'qladdict'
cask 'qlmobi'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'apparency'
cask 'quicklookase'
cask 'qlvideo'

# TODO: sort
cask 'font-lato'
cask 'font-fira-code-nerd-font'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-firago'

# TODO: sort
mas 'Microsoft PowerPoint', id: 462062816
mas 'Keynote', id: 409183694
mas 'Space Gremlin', id: 414515628 # space gremlin # http://www.spacegremlinapp.com/mac/modes.html
mas 'OneDrive', id: 823766827
mas 'Microsoft Excel', id: 462058435
mas 'Key Codes', id: 414568915
mas 'Microsoft Outlook', id: 985367838
mas 'Pages', id: 409201541
mas 'Microsoft Word', id: 462054704
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709
# mas 'SonicWall Mobile Connect', id: 822514576
mas 'Bitwarden', id: 1352778147
mas 'Speedtest by Ookla', id: 1153157709
mas 'WhatsApp Desktop', id: 1147396723
mas 'ZOOM Cloud Meetings', id: 546505307
mas 'Microsoft Teams', id: 1113153706
mas 'Parallels Desktop', id: 1085114709
